### CHAPTER 5

##### SERIES

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([1,2,8,4,2,-7])
obj

0    1
1    2
2    8
3    4
4    2
5   -7
dtype: int64

In [3]:
obj =pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
obj['c'] = 7
obj

a    1
b    2
c    7
d    4
e    5
dtype: int64

In [5]:
del obj['a']

In [6]:
obj

b    2
c    7
d    4
e    5
dtype: int64

In [7]:
obj['a'] = 1

In [8]:
obj

b    2
c    7
d    4
e    5
a    1
dtype: int64

In [9]:
obj

b    2
c    7
d    4
e    5
a    1
dtype: int64

In [2]:
# dictionary can pass in pd series :
data = {'city':'lahore','country':'Pakistan','code':123}
obj1 =pd.Series(data)
obj1

city          [lahore, karaci, islamabad]
country    [Pakistan, Pakistan, Pakistan]
code                      [123, 345, 564]
dtype: object

In [11]:
indexes = ['city','country','D']
obj1 =pd.Series(data, indexes)
obj1

city         lahore
country    Pakistan
D               NaN
dtype: object

In [12]:
pd.isnull(obj1)

city       False
country    False
D           True
dtype: bool

In [13]:
pd.notnull(obj1)

city        True
country     True
D          False
dtype: bool

###### DATAFRAME

In [14]:
from pandas import DataFrame

In [15]:
data = {'Employes':['Iqra','Bushra','Faiza','Ahsan','Ahmed','Ali','Subhan','Shamim'],
        'Designation':['Manager','Asistant','Managing director','Accountant','HR','Office asistant','Purchaser','Maid'],
       'Salary':[50000,45000,65000,8000,3000,12000,60000,75000]
       }
frame=pd.DataFrame(data)
frame

  Employes        Designation  Salary
0     Iqra            Manager   50000
1   Bushra           Asistant   45000
2    Faiza  Managing director   65000
3    Ahsan         Accountant    8000
4    Ahmed                 HR    3000
5      Ali    Office asistant   12000
6   Subhan          Purchaser   60000
7   Shamim               Maid   75000

In [16]:
# it shows only first five records
frame.head()

  Employes        Designation  Salary
0     Iqra            Manager   50000
1   Bushra           Asistant   45000
2    Faiza  Managing director   65000
3    Ahsan         Accountant    8000
4    Ahmed                 HR    3000

In [17]:
frame1 =pd.DataFrame(data, columns=['Designation','Employes','Salary','Company'], index =['one','two','three','four','five','six','seven','eight'])
frame1

             Designation Employes  Salary Company
one              Manager     Iqra   50000     NaN
two             Asistant   Bushra   45000     NaN
three  Managing director    Faiza   65000     NaN
four          Accountant    Ahsan    8000     NaN
five                  HR    Ahmed    3000     NaN
six      Office asistant      Ali   12000     NaN
seven          Purchaser   Subhan   60000     NaN
eight               Maid   Shamim   75000     NaN

In [18]:
frame1['Company'] = ['IRA','SEC','DPA','CMD','SKR','URL','DDP','PPL']
frame1

             Designation Employes  Salary Company
one              Manager     Iqra   50000     IRA
two             Asistant   Bushra   45000     SEC
three  Managing director    Faiza   65000     DPA
four          Accountant    Ahsan    8000     CMD
five                  HR    Ahmed    3000     SKR
six      Office asistant      Ali   12000     URL
seven          Purchaser   Subhan   60000     DDP
eight               Maid   Shamim   75000     PPL

In [19]:
frame1.loc['three']

Designation    Managing director
Employes                   Faiza
Salary                     65000
Company                      DPA
Name: three, dtype: object

In [20]:
import pandas as pd
val =pd.Series(['USA','UAE','UK'], index=["six",'five','one'])

In [21]:
frame1['Company']=val
frame1

             Designation Employes  Salary Company
one              Manager     Iqra   50000      UK
two             Asistant   Bushra   45000     NaN
three  Managing director    Faiza   65000     NaN
four          Accountant    Ahsan    8000     NaN
five                  HR    Ahmed    3000     UAE
six      Office asistant      Ali   12000     USA
seven          Purchaser   Subhan   60000     NaN
eight               Maid   Shamim   75000     NaN

In [22]:
import numpy as np
frame1['Salary']=np.arange(8)

In [23]:
frame1

             Designation Employes  Salary Company
one              Manager     Iqra       0      UK
two             Asistant   Bushra       1     NaN
three  Managing director    Faiza       2     NaN
four          Accountant    Ahsan       3     NaN
five                  HR    Ahmed       4     UAE
six      Office asistant      Ali       5     USA
seven          Purchaser   Subhan       6     NaN
eight               Maid   Shamim       7     NaN

In [24]:
frame1['admin']=frame1.Designation == 'HR'
frame1

             Designation Employes  Salary Company  admin
one              Manager     Iqra       0      UK  False
two             Asistant   Bushra       1     NaN  False
three  Managing director    Faiza       2     NaN  False
four          Accountant    Ahsan       3     NaN  False
five                  HR    Ahmed       4     UAE   True
six      Office asistant      Ali       5     USA  False
seven          Purchaser   Subhan       6     NaN  False
eight               Maid   Shamim       7     NaN  False

In [25]:
frame1

             Designation Employes  Salary Company  admin
one              Manager     Iqra       0      UK  False
two             Asistant   Bushra       1     NaN  False
three  Managing director    Faiza       2     NaN  False
four          Accountant    Ahsan       3     NaN  False
five                  HR    Ahmed       4     UAE   True
six      Office asistant      Ali       5     USA  False
seven          Purchaser   Subhan       6     NaN  False
eight               Maid   Shamim       7     NaN  False

In [26]:
del frame1['Salary']

In [27]:
frame1

             Designation Employes Company  admin
one              Manager     Iqra      UK  False
two             Asistant   Bushra     NaN  False
three  Managing director    Faiza     NaN  False
four          Accountant    Ahsan     NaN  False
five                  HR    Ahmed     UAE   True
six      Office asistant      Ali     USA  False
seven          Purchaser   Subhan     NaN  False
eight               Maid   Shamim     NaN  False

In [28]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
 pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [29]:
frame2 =pd.DataFrame(pop)
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [30]:
frame2.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [31]:
frame3=pd.DataFrame(pop, index=[2001,2002,2003])
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [32]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [33]:
frame3.index.name = "year" ; frame3.columns.name="state"
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN

In [34]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, nan]])

### Index Objects

In [35]:
 obj = pd.Series(range(3), index=['a', 'b', 'c'])
 obj

a    0
b    1
c    2
dtype: int64

In [36]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

## 5.2 Essential Functionality

### Reindexing

In [37]:
import pandas as pd
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [38]:
obj2=obj.reindex(['a','b','c','e','d'])
obj2

a   -5.3
b    7.2
c    3.6
e    NaN
d    4.5
dtype: float64

In [39]:
obj3=pd.Series(['yellow','red','blue'], index=[0,2,4])
obj3

0    yellow
2       red
4      blue
dtype: object

In [40]:
obj3.reindex(range(6), method='ffill')

0    yellow
1    yellow
2       red
3       red
4      blue
5      blue
dtype: object

In [41]:
import numpy as np

In [42]:
frame =pd.DataFrame(np.arange(9).reshape((3,3)) ,index=["a",'c','d'], columns=['Ohio','Nevada','texas'])
frame

   Ohio  Nevada  texas
a     0       1      2
c     3       4      5
d     6       7      8

In [43]:
frame2=frame.reindex(['d','c','b','a'])
frame2

   Ohio  Nevada  texas
d   6.0     7.0    8.0
c   3.0     4.0    5.0
b   NaN     NaN    NaN
a   0.0     1.0    2.0

In [44]:
states =['Ohio','texas','Coloumbia','Nevada']

In [45]:
frame.reindex(columns=states)

   Ohio  texas  Coloumbia  Nevada
a     0      2        NaN       1
c     3      5        NaN       4
d     6      8        NaN       7

In [46]:
frame.loc[['a', 'b', 'c','d'], states]

D:\New folder\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Ohio  texas  Coloumbia  Nevada
a   0.0    2.0        NaN     1.0
b   NaN    NaN        NaN     NaN
c   3.0    5.0        NaN     4.0
d   6.0    8.0        NaN     7.0

## Dropping Entries from an Axis

In [47]:
s= pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [48]:
s1=s.drop("e")
s1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [5]:
import numpy as np

In [10]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.columns.name='count'
data.index.name='state'
data

count     one  two  three  four
state
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data1=data.drop(['Ohio'])
data1

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data.drop("one" , axis=1)

count     two  three  four
state
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [18]:
data.drop('Ohio')

count     one  two  three  four
state
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Indexing, Selection, and Filtering

In [53]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [54]:
obj['a']

0.0

In [55]:
obj[1]

1.0

In [56]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [57]:
obj[[1,0,2,3]]

b    1.0
a    0.0
c    2.0
d    3.0
dtype: float64

In [58]:
obj[obj>0]

b    1.0
c    2.0
d    3.0
dtype: float64

In [59]:
obj['b':'c']=5

In [60]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [61]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
 data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [64]:
data.drop(['one','two'], axis='columns')

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [65]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [66]:
data[["one",'two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [67]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [68]:
data[data['two']>5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [70]:
data[data['one']>5]=0

In [71]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        0    0      0     0
New York    0    0      0     0

## Selection with loc and iloc

In [72]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [73]:
data.iloc[2,[0,3,1]]

one     0
four    0
two     0
Name: Utah, dtype: int32

In [74]:
data.iloc[2]

one      0
two      0
three    0
four     0
Name: Utah, dtype: int32

In [75]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah         0    0    0

In [76]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        0    0      0     0
New York    0    0      0     0

In [77]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6

## Integer Indexes

In [78]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [79]:
ser[1]

1.0

In [80]:
ser=pd.Series(np.arange(3.), index=['a','b','c'])
ser

a    0.0
b    1.0
c    2.0
dtype: float64

In [81]:
ser[-1]

2.0

## Arithmetic and Data Alignment

In [82]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [83]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [84]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [85]:
d1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
d2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [86]:
d1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [87]:
d2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [88]:
d1 + d2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [89]:
df1=pd.DataFrame({'A':[1,2]})
df1

   A
0  1
1  2

In [90]:
df2 =pd.DataFrame({'B':[2,4]})
df2

   B
0  2
1  4

In [91]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

## Arithmetic methods with fill values

In [92]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [93]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [94]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [95]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [96]:
 df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

## Operations between DataFrame and Series

In [97]:
import numpy as np
arr =np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [98]:
arr[0]

array([0., 1., 2., 3.])

In [99]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [100]:
import pandas as pd
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [101]:
series =frame.iloc[0]

In [102]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [103]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [104]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [105]:
series3 =frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [106]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping

In [107]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    2.539061 -0.777026 -0.010580
Ohio    2.191976  0.282413 -1.930019
Texas   2.372473  1.241385  0.368792
Oregon -0.526055  0.082530  0.783422

In [108]:
np.abs(frame)

               b         d         e
Utah    2.539061  0.777026  0.010580
Ohio    2.191976  0.282413  1.930019
Texas   2.372473  1.241385  0.368792
Oregon  0.526055  0.082530  0.783422

In [109]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.065115
d    2.018412
e    2.713442
dtype: float64

## Sorting and Ranking

In [110]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [111]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [112]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [113]:
frame.sort_index(1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [116]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [2, 1, 3, 4]})
frame

   b  a
0  4  2
1  7  1
2 -3  3
3  2  4

In [119]:
frame.sort_values(by='a')

   b  a
1  7  1
0  4  2
2 -3  3
3  2  4

In [120]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [ ]:
obj.rank()

In [124]:
s=pd.Series([0,1,4,3,5,7,6])
s.rank()

0    1.0
1    2.0
2    4.0
3    3.0
4    5.0
5    7.0
6    6.0
dtype: float64

In [127]:
s.rank(ascending=False, method='max')

0    7.0
1    6.0
2    4.0
3    5.0
4    3.0
5    1.0
6    2.0
dtype: float64

In [128]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [129]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [130]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

In [3]:
import pandas as pd
obj=pd.Series(range(5), index=['a','a','c','b','c'])
obj

a    0
a    1
c    2
b    3
c    4
dtype: int64

In [4]:
obj.index.is_unique

False

In [5]:
obj["a"]

a    0
a    1
dtype: int64

In [10]:
import numpy as np
df=pd.DataFrame(np.random.randn(4,3), index=['a','b','b','d'])
df

          0         1         2
a -1.559736  1.456411 -0.257613
b  0.467463  1.189917 -1.060496
b  0.120457  2.819982  0.447512
d -0.843719 -1.490042 -0.098777

In [11]:
df.loc['b']

          0         1         2
b  0.467463  1.189917 -1.060496
b  0.120457  2.819982  0.447512

##  Summarizing and Computing Descriptive Statistics

In [12]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [13]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [14]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [15]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [16]:
df.idxmax()

one    b
two    d
dtype: object

In [17]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [18]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [19]:
s =pd.Series(['a','b','c','d']*4)

In [ ]:
s

In [21]:
s.describe()

count     16
unique     4
top        d
freq       4
dtype: object

## Correlation and Covariance

# CHAPTER 6 
## Data Loading, Storage, and File Formats

In [2]:
import os
a = os.listdir('.')
a

['.ipynb_checkpoints',
 '29thSeptNumpy.ipynb',
 'assignment 1.ipynb',
 'Assignment 2.ipynb',
 'Assignment 3.ipynb',
 'Assignment 4.ipynb',
 'Assignment 5.ipynb',
 'Assignment_2.ipynb',
 'game.py',
 'numpy_test.ipynb',
 'Pandas Ch 6.ipynb',
 'pandas test.ipynb',
 'Untitled.ipynb',
 'Untitled2.ipynb']

In [3]:
import pandas as pd

In [4]:
data = pd.read_csv('TAXRATES1.csv')
data

FileNotFoundError: [Errno 2] File b'TAXRATES1.csv' does not exist: b'TAXRATES1.csv'